URL/testcase/UrlAdapter/fullDynami/.$fullDynamicGET.trace/request.log

POST /URLService/URLPortType HTTP/1.0
X-Bridge: NoErrorReturn
Request-ID: fullDynamicGET_1756238925482
SOAPAction: 
User-Agent: SOAPTestTool/1.0 (Java HotSpot(TM) 64-Bit Server VM/25.92-b14)
Host: localhost:12144
Content-Length: 544
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:ns0="urn:Services.URLService.URLPortType.URLPortType"
              xmlns:bridge="http://e2e.ch/bridge"
              xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
   <env:Header>
      <bridge:Trace level="None" maxSize="10"/>
   </env:Header>
   <env:Body>
      <ns0:fullDynamicGET/>
   </env:Body>
</env:Envelope>